package examples;

import JMathEngine.MathEngine;
import JMathEngine.Number;


public class BasicOperations {
    public static void main(String[] args){
        String[] data = new String[]{
            "1+1",
            "2+2*2",
            "(2+2)*2",
            "2^2^3",
            "12--12",
            "(((2+3)*(4+5))^2 + (6+7)*(8+9))",

            //Если в выражении присутствуют логические операторы то:
            //1 будет возвращена если все логические операторы вернули true
            //и 0 будет возвращен если хотябы один логический оператор вернул false;
            // false -> 0
            //true -> 1
            "1<2",
            "1>2",
            "2>2",
            "2>=2",
            "0==0",
            "0==0.0000000000000000000000000000000000001",
            "5 > 3 < 4 > 2 < 6",
            "0!=0",
            "1!=0",
            "((( (2+2) * (3+3) )))",
            ".1 + .2",
            "6/10",
            // если число не возможно поделить с сохранением точености
            // оно будет преобразовано в Ratioanal (класс который хранит дроби)
            "1/3*3", // вернет 1 а не 0.999...
            "2/3/3",
            ".1/.3", // вернет дробь 1/3
            "10/13/2", //вернет 5/13
            "(1/3)*(1/3)",
            "(2/3)^3",
            "10/3//3",
            "10//3",
            "10/3",
            "10%2",
            "10%3",
            "1/3==2/6",
            "-(2+2)",
            "-(10-20)",
            "-1/3",
            "-(1/3^2)"
        };
        // "--" -> "+"
        // "-+" -> "-"
        // "++" -> "+"
        // "+-" -> "-"
        MathEngine engine = new MathEngine();
        for (String text:data){
            Number responce = engine.evaluate(text);
            System.out.println(text+" -> "+responce);
        }
    }
}
